## Introduction to Databases

### SQLite exercises (based on [this](https://www.w3resource.com/sqlite-exercises/) website)

!pip install tabulate

In [ ]:
import os
import sys
import time
import datetime
import numpy as np
import pandas as pd

from tabulate import tabulate

import sqlite3

![Db Schema](../SampleDBs/database-model.gif)

### Establishing a connection

In [ ]:
conn = sqlite3.connect(os.path.join("..","SampleDBs",'hr.sqlite'))
cur = conn.cursor()

In [ ]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cur.fetchall())

[('countries',), ('regions',), ('locations',), ('departments',), ('jobs',), ('employees',), ('department',), ('job_history',), ('prod_mast',), ('prod_backup',), ('orders',), ('tb1',), ('ESERCICIO1',), ('users',), ('tags',), ('s',), ('r',), ('Emor',), ('MIN_SALARY',), ('employee_data',), ('STUDENT',), ('EMPLOYEE_INCOME',), ('details',)]

In [ ]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(tabulate(cur.fetchall()))

---------------
countries
regions
locations
departments
jobs
employees
department
job_history
prod_mast
prod_backup
orders
tb1
ESERCICIO1
users
tags
s
r
Emor
MIN_SALARY
employee_data
STUDENT
EMPLOYEE_INCOME
details
---------------

In [ ]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
for res in cur.fetchall():
    print(res)

('countries',)
('regions',)
('locations',)
('departments',)
('jobs',)
('employees',)
('department',)
('job_history',)
('prod_mast',)
('prod_backup',)
('orders',)
('tb1',)
('ESERCICIO1',)
('users',)
('tags',)
('s',)
('r',)
('Emor',)
('MIN_SALARY',)
('employee_data',)
('STUDENT',)
('EMPLOYEE_INCOME',)
('details',)

In [ ]:
df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)
df.head(10)

          name
0    countries
1      regions
2    locations
3  departments
4         jobs
5    employees
6   department
7  job_history
8    prod_mast
9  prod_backup

### SQL Questions

+ Write a query to display the names (first_name, last_name) using alias name "First Name", "Last Name" on the table "employees"

+ Write a query to get unique department ID on the table "employees"

+ Write a query to get all employee details from the employee table order by first name, descending on the table "employees"

+ Write a query to get the names (first_name, last_name), salary, PF of all the employees (PF is calculated as 12% of salary) on the table "employees"

+ Write a query to get the employee ID, names (first_name, last_name), salary in ascending order of salary on the table "employees"

+ Write a query to get the total salaries payable to employees on the table "employees"

+ Write a query to get the maximum and minimum salary from employees table on the table "employees"

+ Write a query to get the average salary and number of employees in the employees table on the table "employees"

+ Write a query to get the number of employees working with the company on the table "employees"

+ Write a query to get the number of jobs available in the employees table on the table "employees"

+ Write a query get all first name from employees table in upper case on the table "employees"

+ Write a query to get the first 3 characters of first name from employees table on the table "employees"

+ Write a query to calculate 171*214+625.

+ Write a query to get the names (for example Ellen Abel, Sundar Ande etc.) of all the employees from employees table

+ Write a query to get first name from employees table after removing white spaces from both side on the table "employees"

+ Write a query to get the length of the employee names (first_name, last_name) from employees table on the table "employees"

+ Write a query to select first 10 records from a table on the table "employees"  
Note : Assume the salary field provides the 'annual salary' information.

+ Write a query to get monthly salary (round 2 decimal places) of each and every employee? - on the table "employees"

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 on the table "employees"

+ Write a query to display the names (first_name, last_name) and department ID of all employees in departments 30 or 100 in ascending alphabetical order by department ID on the table "employees"

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 and are in department 30 or 100 on the table "employees"

+ Write a query to display the first_name of all employees who have both an "b" and "c" in their first name. on the table "employees"

+ Write a query to display the last name, job, and salary for all employees whose job is that of a Programmer or a Shipping Clerk, and whose salary is not equal to $4,500, $10,000, or $15,000 on the table "employees"

+ Write a query to display the last names of employees whose names have exactly 6 characters on the table "employees"

+ Write a query to display the last names of employees having 'e' as the third character on the table "employees"

+ Write a query to display the jobs/designations available in the employees table on the table "employees"

+ Write a query to display the names (first_name, last_name), salary and PF (15% of salary) of all employees on the table "employees"

+ Write a query to list the number of jobs available in the employees table.

+ Write a query to get the total salaries payable to employees.

+ Write a query to get the minimum salary from employees table.

+ Write a query to get the maximum salary of an employee working as a Programmer.

+ Write a query to get the average salary and number of employees working the department 90.

+ Write a query to get the highest, lowest, sum, and average salary of all employees.

+ Write a query to get the number of employees with the same job.

+ Write a query to get the difference between the highest and lowest salaries.

+ Write a query to find the manager ID and the salary of the lowest-paid employee for that manager.

+ Write a query to get the department ID and the total salary payable in each department.

+ Write a query to get the average salary for each job ID excluding programmer.

+ Write a query to get the total salary, maximum, minimum, average salary of employees (job ID wise), for department ID 90 only.

+ Write a query to get the job ID and maximum salary of the employees where maximum salary is greater than or equal to $4000.

+ Write a query to get the average salary for all departments employing more than 10 employees.

+ Write a query to find the names (first_name, last_name) and salaries of the employees who have a higher salary than the employee whose last_name='Bull'.

+ Write a query to find the names (first_name, last_name) of all employees who works in the IT department.

+ Write a query to find the names (first_name, last_name) of the employees who have a manager who works for a department based in the United States. Hint : Write single-row and multiple-row subqueries

+ Write a query to find the names (first_name, last_name) of the employees who are managers.

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is greater than the average salary.

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is equal to the minimum salary for their job grade.

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than the average salary and who works in any of the IT departments.

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than Mr. Bell.

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn the same salary as the minimum salary for all departments.

+ Write a query to find the names (first_name, last_name) of the employees who are not supervisors.

+ Write a query to display the employee ID, first name, last names, salary of all employees whose salary is above average for their departments.

+ Write a query to find the 5th maximum salary in the employees table.

+ Write a query to find the 4th minimum salary in the employees table.

+ Write a query to select last 10 records from a table.

+ Write a query to list department number, name for all the departments in which there are no employees in the department.

+ Write a query to find the addresses (location_id, street_address, city, state_province, country_name) of all the departments.

+ Write a query to find the names (first_name, last name), department ID and the name of all the employees.

+ Write a query to find the employee id, name (last_name) along with their manager_id, manager name (last_name).

+ Write a query to find the names (first_name, last_name) and hire date of the employees who were hired after 'Jones'.

+ Write a query to get the department name and number of employees in the department.

+ Write a query to find the employee ID, job title number of days between ending date and starting date for all jobs in department 90 from job history.

+ Write a query to display the department ID, department name, and manager first name.

+ Write a query to display the department name, manager name, and city.

+ Write a query to display the job title and average salary of employees.

+ Write a query to to display job title, employee name, and the difference between the salary of the employee and minimum salary for the job.

+ Write a query to display the job history that was done by any employee who is currently drawing more than 10000 of salary.